ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_l2cap.h
/*******************************************************************************
* \file cy_ble_stack_l2cap.h
* \version 2.0
*
* \brief
*  This file contains declarations of public BLE APIs of L2CAP.
*  Also specifies the defines, constants, and data structures required for the APIs.
* 
* Related Document:
*  BLE Standard Spec - CoreV4.2, CSS, CSAs, ESR05, ESR06
* 
********************************************************************************
* \copyright
* Copyright 2014-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#ifndef CY_BLE_STACK_L2CAP_H_
#define CY_BLE_STACK_L2CAP_H_


/***************************************
* Common stack includes
***************************************/

#include "cy_ble_stack_gap.h"


/***************************************
** L2CAP Constants
***************************************/
/** LE IPSP PSM */
#define CY_BLE_L2CAP_PSM_LE_PSM_IPSP        0x0023u
/** L2CAP Invalid PSM */
#define CY_BLE_L2CAP_PSM_INVALID             0x0000u

/** L2CAP Header Size */
#define CY_BLE_L2CAP_HDR_LEN                 0x04u /**< L2CAP header len */
#define CY_BLE_L2CAP_CREDIT_MODE_HDR_LEN     0x06u /**< L2CAP credit mode header len */

/** L2CAP Connect Results */
/** l2cap connection pending */
#define CY_BLE_L2CAP_CONNECTION_SUCCESSFUL                               0x0000u
 /** l2cap connection pending */
#define CY_BLE_L2CAP_CONNECTION_PENDING                                  0x0001u
/** l2cap connection refused due to unsupported psm */
#define CY_BLE_L2CAP_CONNECTION_REFUSED_PSM_UNSUPPORTED                  0x0002u
/** l2cap connection refused due to security block */
#define CY_BLE_L2CAP_CONNECTION_REFUSED_SECURITY_BLOCK                   0x0003u
/** l2cap connection refused due to no resources */
#define CY_BLE_L2CAP_CONNECTION_REFUSED_NO_RESOURCE                      0x0004u
/** l2cap connection refused due to insufficient authentication */
#define CY_BLE_L2CAP_CONNECTION_REFUSED_AUTHENTICATION_INSUFFICIENT      0x0005u
/** l2cap connection refused due to insufficient authorization */
#define CY_BLE_L2CAP_CONNECTION_REFUSED_AUTHORIZATION_INSUFFICIENT       0x0006u
/** l2cap connection refused due to insufficient enc key size */
#define CY_BLE_L2CAP_CONNECTION_REFUSED_ENC_KEY_SIZE_INSUFFICIENT        0x0007u
/** l2cap connection refused due to insufficient encryption */
#define CY_BLE_L2CAP_CONNECTION_REFUSED_ENCRYPTION_INSUFFICIENT          0x0008u
/** l2cap connection refused due to source cid is invalid */
#define CY_BLE_L2CAP_CONNECTION_REFUSED_SRC_CID_INVALID                  0x0009u
/** l2cap connection refused due to source cid already allocated */
#define CY_BLE_L2CAP_CONNECTION_REFUSED_SRC_CID_ALREADY_ALLOCATED        0x000Au
/** l2cap connection refused due to unacceptable parameters */
#define CY_BLE_L2CAP_CONNECTION_REFUSED_UNACCEPTABLE_PARAMETERS          0x000Bu

/**Response codes for Connection parameter update request */
/** Connection Parameters accepted */
#define CY_BLE_L2CAP_CONN_PARAM_ACCEPTED            0x0000u
/** Connection Parameters rejected */
#define CY_BLE_L2CAP_CONN_PARAM_REJECTED            0x0001u

/** Config Parameter index for PSM */
#define CY_BLE_L2CAP_CONFIG_POS_PSM                 0x00u

/** Config Parameter index for CBFC Channel */
#define CY_BLE_L2CAP_CONFIG_POS_CHANNEL                0x01u

/** Config Parameter index for L2CAP Signalling timeout */
#define CY_BLE_L2CAP_CONFIG_POS_SIG_TO                0x02u

/***************************************
** Enumerated Types
***************************************/

/**
 \addtogroup group_ble_common_api_l2cap_definitions
 @{
*/

/** Reason for command reject event - CY_BLE_EVT_L2CAP_COMMAND_REJ */
typedef enum
{
    /** Command Not Understood */
    CY_BLE_L2CAP_COMMAND_NOT_UNDERSTOOD = 0x0000u,
    
    /** Signaling L2CAP MTU exceeded */
    CY_BLE_L2CAP_SIGNALLING_MTU_EXCEEDED,
    
    /** Invalid Connection Identifier in request */
    CY_BLE_L2CAP_INVALID_CID_IN_REQUEST

}cy_en_ble_l2cap_command_rej_reason_t;

/** The result code of call back structures for L2CAP */
typedef enum
{
    /** Operation Successful */
    CY_BLE_L2CAP_RESULT_SUCCESS = 0x0000u,

    /** Command timeout,  if l2cap signaling channel timeout occurs, app should disconnect.*/
    CY_BLE_L2CAP_RESULT_COMMAND_TIMEOUT = 0x2318u,

    /** Invalid sdu length */
    CY_BLE_L2CAP_RESULT_INCORRECT_SDU_LENGTH = 0x2347u,

    /** Not enough credit to perform this operation */
    CY_BLE_L2CAP_RESULT_NOT_ENOUGH_CREDITS = 0x2371u,
    
    /** Credit overflow. Total credit exceeded 65535 (maximum) */
    CY_BLE_L2CAP_RESULT_CREDIT_OVERFLOW = 0x2373u,
    
    /** Invalid credit value, receive credit is Zero */
    CY_BLE_L2CAP_RESULT_UNACCEPTABLE_CREDIT_VALUE = 0x2374u

}cy_en_ble_l2cap_result_param_t;

/***************************************
** Exported data structures
***************************************/

/** L2CAP Credit based flow Connection parameter */
typedef struct 
{
    /** PSM value of the higher-level protocol */
    uint16_t   l2capPsm;

    /** Upper Layer defined Receive Credit Low Mark */
    uint16_t   creditLwm;

}cy_stc_ble_l2cap_cbfc_psm_info_t;

/** L2CAP Credit based flow Connection parameter */
typedef struct 
{
    /** L2CAP MTU - Maximum SDU Size
 
       The L2CAP MTU field specifies the maximum SDU size (in octets) that the L2CAP
       layer entity sending the LE Credit Based Connection Request can receive
       on this channel. L2CAP implementations shall support a minimum L2CAP MTU size
       of 23 octets. */
    uint16_t   mtu;

    /** MPS - Maximum PDU Size 
 
       The MPS field specifies the maximum payload size (in octets) that the
       L2CAP layer entity sending the LE Credit Based Connection Request is
       capable of receiving on this channel. L2CAP implementations shall support
       a minimum MPS of 23 octets and may support an MPS up to 65488 octets. */
    uint16_t   mps;

    /** Initial Number of Credits
    
       The initial credit value indicates the number of LE-frames that the peer
       device can send to the L2CAP layer entity sending the LE Credit Based
       Connection Request. The initial credit value shall be in the range of 0 to
       65535. */
    uint16_t   credit;

}cy_stc_ble_l2cap_cbfc_connection_info_t;

/** Connect request parameter*/
typedef struct
{
    /** L2CAP Credit based flow Connection parameter */
    cy_stc_ble_l2cap_cbfc_connection_info_t  connParam;

    /**  Remote PSM value */
    uint16_t                              remotePsm;

    /** Local PSM value */
    uint16_t                              localPsm;

    /** bd handle of the remote device */
    uint8_t                               bdHandle;

}cy_stc_ble_l2cap_cbfc_conn_req_info_t;

/** L2cap flow contol state */
typedef struct
{
    /**
    * States indicated by flowState variable
    *
    * CY_BLE_STACK_STATE_BUSY (0x01) = CY_BLE_STACK_STATE_BUSY indicates to the application that the BLE stack's internal buffers
    *                    are about to be filled, and the remaining buffers are required to respond to the peer BLE device.
    *                    After this event, the application shall not initiate GATT, GAP Security, or L2CAP data transactions.
    *                    However the application shall respond to peer initiated transactions to prevent BLE protocol timeouts
    *                    from occurring.
    *                    Application-initiated data transactions can be resumed after the CY_BLE_EVT_STACK_BUSY_STATUS
    *                    event when parameter 'CY_BLE_STACK_STATE_FREE' is received.
    *
    * CY_BLE_STACK_STATE_FREE (0x00) = CY_BLE_STACK_STATE_FREE indicates application that pending transactions are completed
    *                    and sufficient buffers are available to process application-initiated transactions.
    *                    The 'CY_BLE_EVT_STACK_BUSY_STATUS' event with 'CY_BLE_STACK_STATE_FREE' indicates to the
    *                    application whether the BLE Stack's internal buffer state has transitioned from 'CY_BLE_STACK_STATE_BUSY'
    *                    to 'CY_BLE_STACK_STATE_FREE'.
    */
    uint8_t                              flowState;

    /** bd handle of the remote device */
    uint8_t                               bdHandle;

