ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_l2cap.h
}cy_stc_ble_l2cap_state_info_t;

/** Connect response parameter*/
typedef struct
{
    /** L2CAP Credit based flow Connection parameter */
    cy_stc_ble_l2cap_cbfc_connection_info_t     connParam;

    /**  This parameter specifies the local L2CAP channel end-point for this new L2CAP channel. 
           On receipt of L2CAP Connect Request command from the peer, the local L2CAP will temporarily create a channel. 
              This parameter identifies the new channel. If the upper-layer PSM chooses to reject this connection, 
              this temporary channel will be closed. */
    uint16_t                                localCid;

    /** This parameter specifies the response of the upper layer for the new L2CAP channel establishment 
           request from the peer. It must be set to a value as specified in L2CAP Connect Result Codes. Refer
              to Bluetooth 4.1 core specification, Volume 3, Part A, section 4.23 for more details. */
    uint16_t                                response;

}cy_stc_ble_l2cap_cbfc_conn_resp_info_t;

/** Connect response parameter*/
typedef struct
{
    /**  This parameter specifies the local L2CAP channel end-point for this new L2CAP channel. 
           On receipt of L2CAP Connect Request command from the peer, the local L2CAP will temporarily create a channel. 
              This parameter identifies the new channel. If the upper-layer PSM chooses to reject this connection, 
              this temporary channel will be closed. */
    uint16_t   localCid;

    /** The credit value field represents number of credits the receiving device can increment. 
          The credit value field is a number between 1 and 65535.*/
    uint16_t   credit;
    
}cy_stc_ble_l2cap_cbfc_credit_info_t;

/** Tx Data parameter*/
typedef struct
{
    /** Transmit data */
    uint8_t     * buffer;

    /** L2CAP Data Packet length. It shall be of lesser the size
             of both local L2CAP MTU & peer L2CAP MTU size. */
    uint16_t      bufferLength;    

    /**This parameter specifies the local channel end-point for the L2CAP
             channel. For the initiator of L2CAP channel establishment, this 
             must be set to the value indicated by the 
             CY_BLE_EVT_L2CAP_CBFC_CONN_CNF event. For the responder, the upper-
             layer protocol obtains this value when it receives the event
             CY_BLE_EVT_L2CAP_CBFC_CONN_IND.*/
    uint16_t      localCid; 

}cy_stc_ble_l2cap_cbfc_tx_data_info_t;

/** Disconnect request parameter */
typedef struct
{
    /**This parameter specifies the local channel end-point for the L2CAP
             channel. For the initiator of L2CAP channel establishment, this 
             must be set to the value indicated by the 
             CY_BLE_EVT_L2CAP_CBFC_CONN_CNF event. For the responder, the upper-
             layer protocol obtains this value when it receives the event
             CY_BLE_EVT_L2CAP_CBFC_CONN_IND.*/
    uint16_t      localCid; 

}cy_stc_ble_l2cap_cbfc_disconn_req_info_t;

/** Connection parameter update response parameter */
typedef struct
{
    /**This field indicates the response to the Connection Parameter Update Request*/
    uint16_t   result; 

    /** bd handle of the remote device */
    uint8_t    bdHandle;

}cy_stc_ble_l2cap_conn_update_param_rsp_info_t;

/** L2CAP queue flow control with water level marking */
typedef struct
{
    /** bd handle of remote device*/
    uint8_t    bdHandle;
    
    /** low water mark level*/
    uint8_t    lowWaterMark;
    
    /** high water level */
    uint8_t    highWaterMark;
    
} cy_stc_ble_l2cap_queue_flow_control_info_t;

/* --------------------------Structure corresponding to events-------------------- */

/** Connect indication parameter*/
typedef struct
{
    /** L2CAP Credit based flow Connection parameter */
    cy_stc_ble_l2cap_cbfc_connection_info_t     connParam;

    /** Local CID */
    uint16_t                                 lCid; 

    /** Local PSM value */
    uint16_t                                 psm; 

    /** bd handle of the remote device */
    uint8_t                               bdHandle;

}cy_stc_ble_l2cap_cbfc_conn_ind_param_t;

/** Connect confirmation parameter*/
typedef struct
{
    /** L2CAP Credit based flow Connection parameter */
    cy_stc_ble_l2cap_cbfc_connection_info_t     connParam;

    /** Local CID*/
    uint16_t                                 lCid; 

    /** Response codes for Connection parameter update request */
    uint16_t                                 response; 

    /** bd handle of the remote device */
    uint8_t                               bdHandle;    

}cy_stc_ble_l2cap_cbfc_conn_cnf_param_t;

/** Disconnect confirmation parameter */
typedef struct
{
    /** Local CID */
    uint16_t                             lCid; 

    /** The result field indicates the outcome of the connection request. The result
       value of 0x0000 indicates success while a non-zero value indicates the connection
       request failed or is pending. */
    cy_en_ble_l2cap_result_param_t         result; 

}cy_stc_ble_l2cap_cbfc_disconn_cnf_param_t;

/** Receive Data parameter */
typedef struct
{
    /** Received L2cap Data */
    uint8_t                            * rxData;

    /** Received L2cap Data Length */
    uint16_t                            rxDataLength;

    /** Local CID */
    uint16_t                            lCid; 

    /** A result value of 0x0000 indicates success, while a non-zero value
       indicates an error condition (e.g. peer device violating credit flow, or L2CAP MTU size limit). */
    cy_en_ble_l2cap_result_param_t      result; 

}cy_stc_ble_l2cap_cbfc_rx_param_t;

/** Rx credit info parameter*/
typedef struct
{
    /** Local CID */
    uint16_t         lCid; 

   /** The number of credits (LE-frames) */
    uint16_t         credit; 

}cy_stc_ble_l2cap_cbfc_low_rx_credit_param_t;

/** Tx credit info parameter */
typedef struct
{
    /** Local CID */
    uint16_t                             lCid; 

    /** The number of credits (LE-frames) */
    uint16_t                         credit; 

    /** A result value of 0x0000 indicates success, while a non-zero value
       indicates an error condition (e.g. credit overflow, or if total number of credits
       crosses specification defined maximum limit of 0xFFFF). */
    cy_en_ble_l2cap_result_param_t           result; 

}cy_stc_ble_l2cap_cbfc_low_tx_credit_param_t;

