ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_l2cap.h
/** Data Write parameter*/
typedef struct
{
    /**Local CID*/
    uint16_t                             lCid; 

    /** A result value of 0x0000 indicates success, 
            while a non-zero value indicates an error condition */
    cy_en_ble_l2cap_result_param_t       result; 

    /** Currently NULL. For future usage */
    uint8_t                             * buffer;

    /** Currently 0. For future usage */
    uint16_t                             bufferLength;    

}cy_stc_ble_l2cap_cbfc_rx_data_param_t;

/** L2CAP Connection parameters  Update response*/
typedef struct
{
    /** connection parameter update response received from the master.
        * Accepted = 0x0000
        * Rejected  = 0x0001 */
    uint16_t      result;

    /** Peer bdHandle */
    uint8_t       bdHandle;

}cy_stc_ble_l2cap_conn_update_rsp_param_t;

/** L2CAP command reject parameter */
typedef struct
{
    /** Reason for command reject  */
    cy_en_ble_l2cap_command_rej_reason_t        result;

    /** Peer bdHandle */
    uint8_t                                   bdHandle;

}cy_stc_ble_l2cap_cmd_rej_param_t;

/** @} */

/***************************************
** Exported APIs
***************************************/

/**
 \addtogroup group_ble_common_api_l2cap_functions
 @{
*/

/******************************************************************************
* Function Name: Cy_BLE_L2CAP_CbfcRegisterPsm
***************************************************************************//**
* 
*  This function registers a new upper-layer protocol or PSM to the L2CAP, along 
*  with the set of callbacks for the L2CAP Credit Based Flow Control mode. This
*  is a blocking function. No event is generated on calling this function.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part A, section 3.4 
*  for more details about credit based flow control mode of operation.
* 
*  \param param: Parameter is of type  'cy_stc_ble_l2cap_cbfc_psm_info_t'
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                               | Description
*  ------------                               | -----------
*   CY_BLE_SUCCESS                            | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER            | Input param is NULL or 'l2capPsm' is 0.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES       | Cannot register more than one PSM.
*   CY_BLE_ERROR_L2CAP_PSM_NOT_IN_RANGE       | The PSM is not in range of 0x0001 - 0x00FF.
*   CY_BLE_ERROR_L2CAP_PSM_ALREADY_REGISTERED | PSM already Registered.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_L2CAP_CbfcRegisterPsm
(
    cy_stc_ble_l2cap_cbfc_psm_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_L2CAP_CbfcUnregisterPsm
***************************************************************************//**
* 
*  This function de-registers an upper-layer protocol or LE_PSM from the L2CAP for 
*  the L2CAP Credit Based Flow Control mode. This is a blocking function. No 
*  event is generated on calling this function.
* 
*  \param param: Parameter is of type  'cy_stc_ble_l2cap_cbfc_psm_info_t'
*              param->creditLwm : ignored
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                           | Description
*  ------------                           | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL for input parameter.
*   CY_BLE_ERROR_INVALID_OPERATION        | Active CID is present with given PSM.
*   CY_BLE_ERROR_L2CAP_PSM_NOT_REGISTERED | PSM is not registered.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_L2CAP_CbfcUnregisterPsm 
(
    cy_stc_ble_l2cap_cbfc_psm_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_L2CAP_CbfcConnectReq
***************************************************************************//**
* 
*  This L2CAP function initiates the L2CAP channel establishment procedure in Credit
*  Based Flow Control (CBFC) mode. Connection establishment is initiated to the
*  specified remote Bluetooth device, for the specified PSM representing an 
*  upper-layer protocol above L2CAP. This is a non-blocking function.
* 
*  At the receiver's end, a CY_BLE_EVT_L2CAP_CBFC_CONN_IND event is generated.
*  In response to this call, a CY_BLE_EVT_L2CAP_CBFC_CONN_CNF event is generated
*  at the sender's end.
*
*  At the sender's end, the CY_BLE_EVT_L2CAP_COMMAND_REJ event is generated if the receiver
*  rejects the connection request.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part A, section 4.22 for
*  more details about this operation.
* 
*  \param param: Parameter is of type 'cy_stc_ble_l2cap_cbfc_conn_req_info_t'.
*     
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                           | Description
*  ------------                              | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | If "param" is NULL.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | Insufficient resources.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY         | 'bdHandle' does not represent known device entity.
*   CY_BLE_ERROR_L2CAP_PSM_NOT_REGISTERED | PSM not Registered.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_L2CAP_CbfcConnectReq
(
    cy_stc_ble_l2cap_cbfc_conn_req_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_L2CAP_CbfcConnectRsp
***************************************************************************//**
* 
*  This L2CAP function enables an upper-layer protocol to respond to the L2CAP 
*  connection request for LE Credit Based Flow Control mode of the specified PSM
*  from the specified remote Bluetooth device. This is a non-blocking function. 
*  The upper-layer PSM must always respond by calling this
*  function upon receiving the CBFC Connection Request 
*  (CY_BLE_EVT_L2CAP_CBFC_CONN_IND) event.
* 
*  The channel is established (opened) only when the PSM concerned responds 
*  with an event indicating success (CY_BLE_EVT_L2CAP_CBFC_CONN_CNF, at the peer
*  device's end). Otherwise, the channel establishment request from the peer 
*  will be rejected by the L2CAP with an appropriate result and status as received 
*  from the upper-layer PSM.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part A, section 4.23
*  for more details about this operation.
*  
*  \param param: Parameter is of type 'cy_stc_ble_l2cap_cbfc_conn_resp_info_t'.
*     
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                                      | Description
*  ------------                                      | -----------
*   CY_BLE_SUCCESS                                   | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER                   | If "param" is NULL.
*   CY_BLE_ERROR_L2CAP_CONNECTION_ENTITY_NOT_FOUND   | Connection entity is not found.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_L2CAP_CbfcConnectRsp
(
    cy_stc_ble_l2cap_cbfc_conn_resp_info_t     * param
);

