ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_l2cap.h
/******************************************************************************
* Function Name: Cy_BLE_L2CAP_CbfcSendFlowControlCredit
***************************************************************************//**
* 
*  This L2CAP function enables an upper-layer protocol to send an LE Flow Control 
*  Credit packet to the peer Bluetooth device when it is capable of receiving
*  additional LE-frames. This is a non-blocking function.
* 
*  This function is invoked when the device is expecting more data from the peer
*  device and it gets an event indicating that the peer device is low on credits
*  CY_BLE_EVT_L2CAP_CBFC_RX_CREDIT_IND for which it needs to respond by sending
*  credits by invoking this function. After the peer device receives these credits,
*  it gets the CY_BLE_EVT_L2CAP_CBFC_TX_CREDIT_IND event indicating the same. It is
*  the responsibility of the application layer of the device sending the credit
*  to keep track of the total number of credits and make sure that it does
*  not exceed 65535.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part A, section 4.24 for
*  more details about this operation.
* 
*  \param param: Parameter is of type 'cy_stc_ble_l2cap_cbfc_credit_info_t'.
*     
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                                    | Description
*  ------------                                    | -----------
*   CY_BLE_SUCCESS                                 | On successful operation.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED          | Memory allocation failed.
*   CY_BLE_ERROR_L2CAP_CONNECTION_ENTITY_NOT_FOUND | L2CAP connection instance is not present.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES            | Insufficient resources.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_L2CAP_CbfcSendFlowControlCredit
(
    cy_stc_ble_l2cap_cbfc_credit_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_L2CAP_ChannelDataWrite
***************************************************************************//**
* 
*  This function sends a data packet on the L2CAP CBFC channel. This is a 
*  blocking function. 
* 
*  This API generates a 'CY_BLE_EVT_L2CAP_CBFC_DATA_WRITE_IND' event that 
*  is kept for backward compatibility and the user should handle cy_en_ble_api_result_t
*  to determine whether the last data packet was sent properly.
* 
*  On the peer device, the CY_BLE_EVT_L2CAP_CBFC_DATA_READ event is used to inform the application 
*  about the data received over the L2CAP CBFC channel.
*
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part A, section 3.4 for 
*  more details about this operation.
* 
*  \param param: Parameter is of type 'cy_stc_ble_l2cap_cbfc_tx_data_info_t'.
*     
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                                    | Description
*  ------------                                    | -----------
*   CY_BLE_SUCCESS                                 | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER                 | If 'param' or 'buffer' is NULL.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED          | Memory allocation failed.
*   CY_BLE_ERROR_NO_CONNECTION                     | No Link Layer connection is present.
*   CY_BLE_ERROR_L2CAP_CONNECTION_ENTITY_NOT_FOUND | No L2CAP channel found corresponding to CID.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_L2CAP_ChannelDataWrite
(
    cy_stc_ble_l2cap_cbfc_tx_data_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_L2CAP_DisconnectReq
***************************************************************************//**
* 
*  This function initiates the sending of an L2CAP Disconnect Request 
*  (CY_BLE_EVT_L2CAP_CBFC_DISCONN_IND event received by the peer device) command 
*  to the remote L2CAP entity to initiate disconnection of the referred L2CAP 
*  channel. This is a non-blocking function.
* 
*  Disconnection of the L2CAP channel always succeeds - either by reception of 
*  the L2CAP Disconnect Response from the peer, or by timeout. In any case, 
*  L2CAP will confirm disconnection of the channel by calling the 
*  CY_BLE_EVT_L2CAP_CBFC_DISCONN_CNF event.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part A, section 4.6 for
*  more details about this operation.
* 
*  \param param: Parameter is of type 'cy_stc_ble_l2cap_cbfc_disconn_req_info_t'.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                                    | Description
*  ------------                                    | -----------
*   CY_BLE_SUCCESS                                 | On successful operation.
*   CY_BLE_ERROR_INVALID_OPERATION                 | No Link Layer connection is present.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED          | Memory allocation failed.
*   CY_BLE_ERROR_L2CAP_CONNECTION_ENTITY_NOT_FOUND | No connection entity found that can be disconnected.    
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES            | Insufficient resources.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_L2CAP_DisconnectReq
(
     cy_stc_ble_l2cap_cbfc_disconn_req_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_L2CAP_LeConnectionParamUpdateRequest
***************************************************************************//**
* 
*  This function sends the connection parameter update request to the Master of
*  the link. This is a non-blocking function. This function can be used 
*  only from a device connected in the LE slave role.
* 
*  To send a connection parameter update request from the master to the slave, 
*  use the Cy_BLE_GAPC_ConnectionParamUpdateRequest() function. This function 
*  results in a CY_BLE_EVT_L2CAP_CONN_PARAM_UPDATE_REQ event at the Master's end.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part A, section 4.20 for
*  more details about this operation.
* 
*  \param param: Parameter is of type 'cy_stc_ble_gap_conn_update_param_info_t'.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                           | Description
*  ------------                           | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | If "connParam" is NULL.
*   CY_BLE_ERROR_INVALID_OPERATION        | Connection Parameter Update Request is not allowed.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_NO_CONNECTION            | No Link Layer connection is  present.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY         | 'bdHandle' does not represent known device entity.
*
*   Note: Please refer the API documentation of Cy_BLE_GAPC_InitConnection for recommended
*   Connection Interval values.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_L2CAP_LeConnectionParamUpdateRequest
(
    cy_stc_ble_gap_conn_update_param_info_t  * param
);


