ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_l2cap.h
/******************************************************************************
* Function Name: Cy_BLE_L2CAP_LeConnectionParamUpdateResponse
***************************************************************************//**
* 
*  This API sends the connection parameter update response to the slave. This API 
*  can be used only from a device connected in the LE master role.
* 
*  This function results in CY_BLE_EVT_L2CAP_CONN_PARAM_UPDATE_RSP event at 
*  the Slave's end.
*
*  \param param: Parameter is of type 'cy_stc_ble_l2cap_conn_update_param_rsp_info_t'.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                           | Description
*  ------------                           |    -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | If 'result' is invalid (greater than connection parameter reject code i.e., 0x0001).
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_NO_CONNECTION            | No Link Layer connection is present.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY         | 'bdHandle' does not represent known device entity.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_L2CAP_LeConnectionParamUpdateResponse
(
    cy_stc_ble_l2cap_conn_update_param_rsp_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_L2CAP_SetFlowControlLimits
***************************************************************************//**
* 
*  This API allows the application to set L2CAP flow control limits using high
*  and low water marking for the L2CAP queue. The application can set high and low
*  water marking for the L2CAP queue using this API.
*
*  During data transmission, when the number of available L2CAP queue entries reaches the
*  low water mark level, the application will receive a CY_BLE_EVT_STACK_BUSY_STATUS event with 
*  status as busy, so that the application can stop queuing data and wait until it 
*  receives a CY_BLE_EVT_STACK_BUSY_STATUS event with free status.
* 
*  \param param: Parameter is of type 'cy_stc_ble_l2cap_queue_flow_control_info_t'.
*   Min Highwater mark: 1    Max HighWater mark: L2cap queue depth
*   Min LowWater mark: 0     Max LowWater mark: (HighWaterMark -1)
*
*   Default values set by stack for better throughput is: LowWaterMark 3, HighWaterMark
*   (L2CAP queue depth - 1).
*
*   Note: If the LowWaterMark is set to less than 3, then do not initiate GATT data 
*   transmission while pairing procedure is going on.
*   
*   For GATT data transmission, the difference between HighWaterMark and 
*   LowWaterMark must not be greater than number of GATT buffers provided during stack-init
*   to avoid receiving a memory allocation error for GATT transaction.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                           | Description
*  ------------                           | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | If 'param' is NULL or water mark levels are not proper.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY         | 'bdHandle' does not represent known device entity.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_L2CAP_SetFlowControlLimits
(
    cy_stc_ble_l2cap_queue_flow_control_info_t  * param
);

#ifdef __cplusplus
}
#endif /* __cplusplus */

/** @} */

#endif /*CY_BLE_STACK_L2CAP_H_*/


/*EOF*/
